<link href="https://fonts.googleapis.com/icon?family=Material+Icons" rel="stylesheet">
<link href="https://fonts.googleapis.com/css?family=Raleway:200" rel="stylesheet">

<link rel="stylesheet" type="text/css" href="css/reset.css" >
        <link rel="stylesheet" type="text/css" href="css/AnimeStyle.css" />

<div class="container" ng-class="{'no-scroll': selected.length}" ng-app="app" ng-controller="mainCtrl">
  <div class="page">
    <div class="grid">
      <div class="grid-item" ng-repeat="item in boxes">
        <box class="box" item="item" on-select="selectBox" ng-class="{'selected': selected[0].item.name == item.name}"></box>
      </div>
    </div>
  </div>
  <div class="fullscreen-background top-up" ng-show="selected.length" ng-style="{'background-image': 'url(' + selected[0].item.image + ')'}"></div>
  <div class="scroller" ng-show="selected.length">
    <a class="close-button" ng-click="clearSelection()">
      <i class="material-icons">close</i>
    </a>
    <h1>{{selected[0].item.name}}</h1>
    <div big-box ng-repeat="item in selected" class="box on-top" position="item.position" selected="item.item">
      <img ng-src="{{item.item.image}}" alt="" />
      <div class="content">
        <h2>เรื่องย่อ</h2>
        <p>{{selected[0].item.description}}</p>
      </div>
    </div>
    
  </div>
</div>


<script src="https://cdnjs.cloudflare.com/ajax/libs/angular.js/1.5.5/angular.min.js"></script>
<script src="https://cdnjs.cloudflare.com/ajax/libs/angular.js/1.5.5/angular-animate.min.js"></script>

<script>var app = angular.module('app', ['ngAnimate'])

app.controller('mainCtrl', function($scope) {
  $scope.boxes = [
    {
    name: 'Vinland Saga Season 2',
    image: 'https://sportshub.cbsistatic.com/i/2022/06/08/94653059-d16f-4567-b63a-a924c90af88f/vinland-saga-season-2.jpg?auto=webp&width=707&height=1000&crop=0.707:1,smart', 
    title:'Vinland Saga Season 2', 
    description:"ที่สุดของการ์ตูนสงครามอิงประวัติศาสตร์ตำนานนักรบในแถบยุโรปทางเหนือที่ถ่ายทอดออกมาได้อย่างสมจริงที่สุดเท่าที่เคยมีการ์ตูนแนวนี้ กับเรื่องราว'ทอลฟีน'เด็กหนุ่มผู้มีชะตากรรมกับสงครามของแผ่นดินระหว่างอังกฤษกับเดนมาร์กและเหล่าไวกิ้ง ที่ต้องการหาเส้นทางและดินแดนแห่งความสงบสุขให้กับตัวเอง อนาคตของเขาจะสมหวังตามจุดมุ่งหมายหรือจะเป็นเพียงปิศาจในสนามรบจนชีพวาย!!?"
  },
  {
    name: 'Tomo-chan wa Onnanoko!',
    image: 'https://www.anime-os.com/info/image/2022/11/Tomo-chan-wa-Onnanoko-150x214.webp', 
    title:'Tomo-chan wa Onnanoko!', 
    description:"เมื่อขึ้นมัธยมปลาย “ไอซาวะ โทโมะ” สาวลุคทอมบอย จึงได้ตัดสินใจสารภาพรักกับ “คุโบตะ จุนอิจิโร่” เพื่อนหนุ่มที่สนิทกันตั้งแต่สมัยเด็ก แต่เขากลับไม่เคยมองเธอในฐานะผู้หญิงเลยสักครั้ง เพราะมองว่าเป็นเธอเป็นเหมือนเพื่อนชายคนหนึ่งมากกว่า ความรักครั้งนี้จึงไม่ใช่เรื่องง่ายอย่างที่คิด"
  },
  {
    name: 'Tokyo Revengers: Seiya Kessen-hen',
    image: 'https://cdn.myanimelist.net/images/anime/1773/132313.webp', 
    title:'Tokyo Revengers: Seiya Kessen-hen', 
    description:"Tokyo Revengers จะเล่าเรื่องราวผ่านตัวละครที่ชื่อว่า มาเคมิจิ ในวัย 26 ปี ที่ใช้ชีวิตที่น่าเหนื่อยหน่ายทำพลาดไปหมดทุกอย่าง ยังพบข่าวที่น่าเศร้าของอดีตแฟนเก่าคนเดียวในชีวิตที่เคยคบกันตอนอยู่ ม.ต้น อย่าง 'ฮินาตะ' เสียชีวิต เนื่องจากถูกฆาตกรรมโดยสมาพันธ์วายร้าย 'โตเกียวมันจิไค'หลังจากรู้ข่าวเศร้าในวันถัดไประหว่างรอรถไฟ ทาเคมิจิ ก็ถูกมือปริศนาผลักหล่นลงไปบนรางรถไฟ เมื่อเขารู้สึกตัวอีกครั้งเขาก็ย้อนเวลากลับไปยังสมัย ม.ต้นเมื่อ 12 ปีก่อนและนั่นคือจุดเริ่มต้นของเรื่องราวทั้งหมด เขาจะต้องย้อนเวลากลับไปเพื่อแก้ไขเรื่องราวในอดีตเพื่อเปลี่ยนแปลงเหตุการณ์ในอนาคต เพื่อให้ตัวเองแข็งแกร่งขึ้นเพื่อให้ฮินาตะมีชีวิตต่อไป"
  },
  {
    name: 'Maou Gakuin no Futekigousha: Shijou Saikyou no Maou no Shiso, Tensei shite Shison-tachi no Gakkou e Kayou II',
    image: 'https://cdn.myanimelist.net/images/anime/1475/137152.jpg', 
    title:'Maou Gakuin no Futekigousha: Shijou Saikyou no Maou no Shiso, Tensei shite Shison-tachi no Gakkou e Kayou II', 
    description:"จอมมารผู้เหี้ยมโหดที่บัดนี้ถูกตีตราว่าเป็นผู้ไม่เหมาะสมได้ตั้งปณิธานที่จะฝ่าฟันไปในโลกยุคใหม่นี้ ไลท์โนเวลต้นฉบับโดย Shu (ชู) เผยแพร่ครั้งแรกบนเว็บไซต์ Shosetsuka ni Naro ในเดือนเมษายนปี 2017 และได้ถูกตีพิมพ์เป็นรูปเล่มโดยเดงเกคิ บุงโกะ (KADOKAWA) ในเดือนมีนาคมปี 2018 และกลายเป็นนิยายติดอันดับยอดตีพิมพ์ถึง 2.2 ล้านเล่ม โดยมี ชิสุมะ โยชิโนริเป็นผู้วาดภาพประกอบ อนิเมในซีซั่นแรกเริ่มฉายในเดือนกรกฎาคมปี 2020 ด้วยตัวละครที่โดดเด่นและเหล่านางเองที่มีเสน่ห์เป็นเอกลักษณ์ทำให้มีเสียงตอบรับที่ดีจากทั้งในและนอกประเทศญี่ปุ่น และหลังจากผ่านมาเป็นเวลา 2 ปี ในที่สุดจอมมารผู้ไม่เหมาะสมก็ได้กลับมาอีกครั้งแล้ว! กับเนื้อเรื่องบทที่โด่งดังที่สุดของซีรี่ส์ “”บทมหาภูต”” ได้กลายมาเป็นแอนิเมชั่นให้ทุกท่านได้รับชมแล้ว ผู้ที่ปรากฏตัวอยู่เบื้องหน้าอานอสผู้ที่ยุติสงครามระหว่างมนุษย์และเผ่ามาร นั้นคือ “”บุตรแห่งเทพ”” คนใหม่ที่จะมากำจัดจอมมารผู้เหี้ยมโหดให้สิ้น บัดนี้ถึงเวลาที่ผู้ไม่เหมาะสมนี้จะฝ่าฟันอุปสรรคมุ่งหน้าสู่ศึกใหม่แล้ว “”หลังจากได้มาเกิดใหม่ในยุคอันสงบสุขนี้ ดูเหมือนว่าข้าจะรู้จักออมมือขึ้นมานิดหน่อยแล้วล่ะ"
  }, 
  {
    name: 'Otonari no Tenshi-sama ni Itsunomanika Dame Ningen ni Sareteita Ken',
    image: 'https://cdn.myanimelist.net/images/anime/1240/133638.jpg', 
    title:'Otonari no Tenshi-sama ni Itsunomanika Dame Ningen ni Sareteita Ken', 
    description:"เรื่องราวเกี่ยวกับอามาเนะอาศัยอยู่คนเดียวในแมนชั่น กับมาฮิรุสาวงามอันดับหนึ่งของโรงเรียนอาศัยอยู่ห้องข้าง ๆ กันกับอามาเนะ พวกเขาทั้งสองไม่มีความสัมพันธ์อะไรกันเลย กระทั่งในวันที่ฝนตก อามาเนะได้เห็นมาฮิรุนั่งคนเดียวอยู่บนชิงช้าในที่สวนสาธารณะท่ามกลางสายฝน โดยเธอไม่มีร่ม อามาเนะจึงยื่นร่มให้กับเธอ หลังจากนั้นความสัมพันธ์ที่ไม่มีชื่อเรียกก็ได้เริ่มต้นขึ้น"
  }, 
  {
    name: 'Ijiranaide, Nagatoro-san 2nd Attack',
    image: 'https://cdn.myanimelist.net/images/anime/1902/129579.webp', 
    title:'Ijiranaide, Nagatoro-san 2nd Attack', 
    description:"นาโอโตะ ฮาจิโอจิ นักเรียนชายปีสองที่ชอบเก็บตัว ที่โรงเรียนเขาชอบหลีกเลี่ยงการพบเจอกับคนอื่นและชอบวาดการ์ตูนในเวลาว่าง ถึงอย่างไรก็ตาม ฮายาเสะ นางาโทโระ เด็กสาวปี 1 บังเอิญพบมังงะที่ นาโอโตะ ฮาจิโอจิ เป็นคนแต่ง และทำการแกล้งเขาจนร้องไห้ จากนั้นเป็นต้นไปเธอจึงเรียกเขาว่า 'รุ่นพี่' เธอมักจะไปที่ห้อง Art Club ที่ นาโอโตะ ฮาจิโอจิ ชอบไปบ่อยๆ และยังคงกลั่นแกล้งเขาเพราะบุคลิกที่ขี้อายและมีความเป็นโอตาคุ ในบางครั้งเธอยังแกล้งที่ส่อไปในทางเพศ และเรียกเขาว่า คนลามก ขณะที่เธอพยายามผลักดันให้เขากล้าแสดงออกมากขึ้น รุ่นพี่ก็เริ่มปิ๊ง นางาโทโร เป็นการตอบแทน และค่อยๆ ออกมาจากเปลือกของเขาและเข้าไปเกี่ยวข้องกับชีวิตของ นางาโทโร"
  }, 
  {
    name: 'NieR:Automata Ver1.1a',
    image: 'https://cdn.myanimelist.net/images/anime/1399/128318.webp', 
    title:'NieR:Automata Ver1.1a', 
    description:"ในปี ค.ศ. 5012 เอเลี่ยนได้ปรากฎตัว ใช้เครื่องจักรมีชีวิตเข้ารุกรานมนุษย์ กลุ่มมนุษย์ที่เหลือน้อยนิดอพยพไปอยู่ดวงจันทร์ เวลาผ่านไป มนุษย์ยังล้มเหลวในการพยายามยึดโลกคืน จนถึงปี ค.ศ. 11945 มนุษย์ได้พัฒนาและส่งกลุ่มแอนดรอยด์กลุ่มหนึ่งที่ล้ำสมัยรวมถึงพวก 2B, 9S มายังโลกเพื่อชิงผืนดินคืนจากพวกเอเลี่ยน"
  }, 
  {
    name: 'Bungou Stray Dogs 4th Season',
    image: 'https://cdn.myanimelist.net/images/anime/1263/132759.webp', 
    title:'Bungou Stray Dogs 4th Season', 
    description:"นาคาจิมะ อัตสึชิ เด็กหนุ่มผู้ถูกขับไล่ออกจากบ้านเด็กกำพร้า และซมซานมาจนถึงโยโกฮาม่า ได้บังเอิญช่วยเหลือชายคนหนึ่งที่ฆ่าตัวตายไม่สำเร็จ และถูกพัดไหลมาตามแม่น้ำ นามของชายคนนั้นคือ ดาไซ โอซามุ  หนึ่งในสมาชิกกลุ่มผู้มีพลังเหนือธรรมชาติ “สำนักงานนักสืบบุโซ” ซึ่งทำงานคลี่คลายคดีอันตราย และกำลังอยู่ระหว่างการสืบสวนเพื่อไขคดี “เสือกินคน” ที่สร้างความวุ่นวายไปทั่ว นาคาจิมะผู้มีชะตาเกี่ยวข้องกับเสือกินคนตัวนั้น ได้ถูกไซเชิญชวนแกมบังคับ ให้มาร่วมการสืบสวนด้วย"
  }, 
  {
    name: 'Buddy Daddies',
    image: 'https://cdn.myanimelist.net/images/anime/1553/133767.webp', 
    title:'Buddy Daddies', 
    description:"ระหว่างปฎิบัติภารกิจที่โรงแรม คาซุกิ และ เรย์ สองหนุ่มคู่หูนักฆ่าที่นิสัยต่างกันคนละขั้ว บังเอิญมาพัวพันกับ มิริ เด็กน้อย 4 ขวบ ซึ่งเป็นลูกสาวลับของหัวหน้าแก๊งมาเฟีย พวกเขาจำเป็นต้องพาเธอมาอยู่กับพวกเขาด้วย"
  }, 
  {
    name: 'Itai no wa Iya nanode Bougyoryoku ni Kyokufuri Shitai to Omoimasu. 2',
    image: 'https://cdn.myanimelist.net/images/anime/1782/128859.webp', 
    title:'Itai no wa Iya nanode Bougyoryoku ni Kyokufuri Shitai to Omoimasu. 2', 
    description:"เรื่องราวของ Honjou Kaede ที่ถูกเพื่อนชวนให้มาเล่นเกม VRMMO “NewWorld Online” และได้ใช้ชื่อในเกมว่า Maple จากความที่เป็นมือใหม่และกลัวเจ็บ เธอจึงปั้นตัวละครตัวเองให้ใช้โล่สุดแกร่งและอัพค่าพลังป้องกันเต็มเหนี่ยวจนผู้เล่นคนอื่นต้องตะลึงในความอึดของเธอ"
  }, 
  {
    name: 'Tondemo Skill de Isekai Hourou Meshi',
    image: 'https://cdn.myanimelist.net/images/anime/1661/131889.webp', 
    title:'Tondemo Skill de Isekai Hourou Meshi', 
    description:"มุโคดะ สึโยชิ ถูกอัญเชิญจากญี่ปุ่นมายังโลกแฟนตาซีพร้อมอีก 3 คน แต่เขากลับมีพลังระดับคนธรรมดา จึงขอออกผจญภัยตามลำพัง มีเพียงสกิลเดียวที่ติดตัวมา “เน็ตซูเปอร์” ที่สามารถสั่งซื้อของจากซูเปอร์มาเก็ตจากญี่ปุ่นได้ด้วยเงินของโลกแฟนตาซี อีกทั้งเขาสามารถทำอาหารได้ดี ทำให้เขาทั้งสามารถหาเงินจากการขายอาหาร ซึ่งช่วยให้เขาเป็นที่รู้จักและหาพรรคพวกที่แข็งแกร่งได้"
  }, 
  {
    name: 'Dungeon ni Deai wo Motomeru no wa Machigatteiru Darou ka IV: Fuka Shou - Yakusai-hen',
    image: 'https://cdn.myanimelist.net/images/anime/1226/131884.jpg', 
    title:'Dungeon ni Deai wo Motomeru no wa Machigatteiru Darou ka IV: Fuka Shou - Yakusai-hen', 
    description:"เรื่องราวเกิดขึ้นในเมือง Orario เมืองนี้เป็นที่ตั้งของเทพเจ้าหลายองค์ที่แสวงหาความตื่นเต้น และเลือกที่จะจำกัดพลังของตนเพื่อที่จะสัมผัสกับความยากลำบาก และได้ลงมาอาศัยอยู่ในโลกมนุษย์ เทพเจ้าแต่ละองค์จึงสร้างกลุ่มที่มีนักผจญภัยและบุคลากรที่คอยสนับสนุนมาจากผู้คนในเมือง จึงเรียกกันว่า (แฟมิเลีย) กิจกรรมหลักขององค์กรเหล่านี้คือการสำรวจเขาวงกตใต้เมืองที่เรียกว่า Dungeon เพื่อต่อสู้กับสัตว์ประหลาดและเก็บเกี่ยวเศษคริสตัลที่มาจะการฆ่าสัตว์ประหลาด เศษเหล่านี้ใช้ในการสร้างไอเท็มเวทมนตร์และสมบัติอื่นๆ เบล แครนเนล เด็กหนุ่มนักผจญภัยหน้าใหม่วัย 14 ปี และเขาเป็นสมาชิกเพียงคนเดียวของ เฮสเทียแฟมิเลีย เครนล ได้ถูกช่วยชีวิตเขาจากสัตว์ประหลาดทรงพลังโดย ไอส์ วาเลนไทน์ นักดาบหญิงผู้โด่งดังและทรงพลังแห่ง Loki แฟมิเลีย และเขาสาบานว่าจะแข็งแกร่งเทียบเท่ากับเธอ"
  }, 
  {
    name: 'Koori Zokusei Danshi to Cool na Douryou Joshi',
    image: 'https://cdn.myanimelist.net/images/anime/1927/132758.webp', 
    title:'Koori Zokusei Danshi to Cool na Douryou Joshi', 
    description:" ฮิมุโระคุง ชายหนุ่มผู้สืบเชื้อสายของสาวหิมะซึ่งใช้ชีวิตอยู่ในยุคปัจจุบัน และคุณฟุยุสึกิ เพื่อนร่วมงานสาวผู้อ่อนโยนและค่อนข้างไม่เหมือนใคร หากมองแค่ผิวเผิน หนุ่มสาวคู่นี้ก็ดูเป็นคนคูลๆ อยู่หรอก แต่พอเป็นเรื่องราวความรักแล้ว ทั้งสองกลับไม่เอาไหนซะเลย ฮิมุโระคุงผู้ได้แต่เก็บความ “ชอบ” ที่มีต่อฟุยุสึกิไว้ในใจประหนึ่งพายุหิมะที่โหมกระหน่ำ โดยไม่กล้าก้าวออกไปเริ่มต้นสักที ส่วนฝ่ายคุณฟุยุสึกิเองก็ช่างความรู้สึกช้าไม่รู้ใจตัวเองเลย!?"
  }, 
  {
    name: 'Saikyou Onmyouji no Isekai Tenseiki',
    image: 'https://cdn.myanimelist.net/images/anime/1547/125900.webp', 
    title:'Saikyou Onmyouji no Isekai Tenseiki', 
    description:"ฮารุโยชิ ผู้เป็นองเมียวจิสุดแกร่ง ได้ถูกเพื่อนสนิททรยศ ก่อนตายเขาใช้วิชาเพื่อให้ได้เกิดใหม่อีกครั้ง เกิดในโลกแฟนตาซี ในตระกูลจอมขมังเวทย์ ถึงตัวเขาไร้คุณสมบัติเวทมนตร์ แต่ยังใช้วิชาจากชาติก่อนได้ กลับแสดงพลังที่เหนือกว่าจอมเวททั่วไปในโลกนี้"
  }, 
  {
    name: 'Kubo-san wa Mob wo Yurusanai',
    image: 'https://cdn.myanimelist.net/images/anime/1818/132330.webp', 
    title:'Kubo-san wa Mob wo Yurusanai', 
    description:" อีกแค่นิดเดียวก็จะรู้สึกตัวแล้ว… ว่าความรู้สึกนี้คือ “ความรัก” สวีตคอเมดี้วัยหวานของ นางเอกสาว x หนุ่มตัวประกอบ ชิราอิชิ จุนตะ หนุ่มนักเรียนมัธยมปลายปี 1 ผู้เป็น “ตัวประกอบ” แสนจืดจางขนาดนั่งอยู่ข้างๆ ก็ยังไม่มีใครเห็น หรือทั้งๆ ที่อยู่ในรูปถ่ายหมู่แต่คนต่างคิดว่เขาไม่ได้อยู่ในรูป มีเพียงสาวน้อยรักอย่งคุณคุโบะ ผู้เรียกได้ว่าอยู่ในลำดับชั้น “นางเอก” ของห้องที่คอยเฝ้ามองเขาและแกล้งล้อเขาเล่นทุกวันㅡ ไม่ว่าใครก็เป็นคนพิเศษของใครสักคนได้ เพียงแต่ทั้งคู่ ยังไม่รู้ว่าความรู้สึกนี้เรียกว่า “ความรัก” สวีตคอเมดี้วัยหวานของนางเอกสาว x หนุ่มตัวประกอบ ที่อีกนิดเดียวก็จะเรียกได้ว่าเลิฟคอมดี้ เริ่มเปิดฉากขึ้นแล้ว!"
  }, 
  {
    name: 'Isekai Nonbiri Nouka',
    image: 'https://cdn.myanimelist.net/images/anime/1983/132329.webp', 
    title:'Isekai Nonbiri Nouka', 
    description:"มาจิโอะ ฮิราคุ พ่อหนุ่มที่เสียชีวิตจากการทำงานหนักและโรคร้าย หลังจากพระเจ้าให้พระเอกเกิดใหม่อีกครั้วในต่างโลก โดยจะเป็นอะไรก็ได้ เขาจะเลือกเป็นเกษตรกร พระเจ้าก็โอเคและแถมเครื่องมือทำเกษตรสารพัดประโยชน์ให้มาใช้ชีวิตใหม่ แต่นี้คือจุดเริ่มต้นเรื่องราวของหนุ่มเกษตรกรสุดแฟนตาซีที่มาใช้ชีวิตต่างโลก พร้อมร่กับแวมไพร์ นางฟ้า และภูตที่ต่างโลก ได้เปิดม่านขึ้นแล้ว"
  }, 
  {
    name: 'Tensei Oujo to Tensai Reijou no Mahou Kakumei',
    image: 'https://cdn.myanimelist.net/images/anime/1053/129004.webp', 
    title:'Tensei Oujo to Tensai Reijou no Mahou Kakumei', 
    description:"อานิสเฟีย วิน พาเลตเทีย เจ้าหญิงแห่งอนาจักรพาเลตเทียที่มีความทรงจำจากชาติก่อน เธอใฝ่ฝันว่าอยากจะโบยบินไปบนท้องฟ้าด้วยเวทมนตร์ อานิสเฟียได้ทำการวิจัยประหลาดๆทั้งวันทั้งคืน ในคืนหนึ่งขณะที่นำไม้กวาดแม่มดที่ประดิษฐ์ขึ้นเองไปทดลองบินนั้น ก็ได้พบกับเหตุการณ์ไม่คาดคิดเกิดขึ้น เธอไม่สามารถควบคุมไม้กวาดได้ อานิสเฟียได้พุ่งชนเข้าไปในงานเลี้ยงโรงเรียนของชนชั้นขุนนาง เธอก็ได้พบกับ “ยูฟิลเลีย” คุณหนูอัจฉริยะผู้เชี่ยวชาญการใช้เวทมนตร์ทุกแขนง ซึ่งขณะนั้นได้ถูก “เจ้าชายอัลการ์ด” บังคับให้ถอนหมั้นต่อหน้าสาธารณะชนเมื่ออานิสเฟียเห็นยูฟิลเลียหลั่งน้ำตาด้วยความเจ็บปวด จึงได้ยื่นมือช่วยเหลือด้วยรอยยิ้ม “ไปกันเถอะค่ะ ฉันจะลักพาตัวคุณไปเอง” เรื่องราวแฟนตาซีเวทมนตร์ของเด็กสาวทั้งสองคนได้เริ่มต้นขึ้นแล้ว!!"
  }, 
  {
    name: 'Trigun Stampede',
    image: 'https://cdn.myanimelist.net/images/anime/1426/129194.webp', 
    title:'Trigun Stampede', 
    description:"เรื่องราวบนดาวอันห่างไกลจากโลกที่เต็มไปด้วยทะเลทรายสุดลูกหูลูกตา แถมยังมีสภาพแวดล้อมอันโหดร้ายด้วยแรงดึงดูดกับอุณหภูมิที่มากกว่าปกติ และท่ามกลางผู้คนที่พยายามใช้ชีวิตด้วยการอาบเหงื่อและเลือด กลับมีพวกป่าเถื่อนยิงปืนทำร้ายซ้ำเติมเข้าไปอีก และบนดาวที่โหดร้ายแห่งนั้นก็มีหนุ่มผมทองใส่โค้ดสีแดงนามว่า “Vash the Stampede” เดินทางพเนจรไปเรื่อยๆ และถึงแม้เขาคนนี้จะดูไม่มีพิษมีภัย แต่ไม่ว่าเขาจะไปที่ไหนก็เกิดเรื่องร้ายอยู่ตลอด จนถูกขนาดนามให้ว่าเป็น “The Humanoid Typhoon” หรือก็คือบุคคลผู้มีอันตรายระดับเดียวกับพวกภัยพิบัติ"
  }, 
  {
    name: 'Ningen Fushin no Boukensha-tachi ga Sekai wo Sukuu you desu',
    image: 'https://cdn.myanimelist.net/images/anime/1446/131578.webp', 
    title:'Ningen Fushin no Boukensha-tachi ga Sekai wo Sukuu you desu', 
    description:"นิก ผู้เคยเป็นสมาชิกปาร์ตี้นักผจญภัยที่เชี่ยวชาญ ช่วยเพื่อนมามาก แต่กลับถูกไล่ออกจากกลุ่ม เขาต้องการหากลุ่มใหม่ ได้มาอยู่พบ 3 นักผจญภัยที่เคยโดนทรยศจากคนที่เคยเชื่อใจมาก่อน และต่างไม่ไว้ใจคนอื่น เรื่องราวการผจญภัยของปาร์ตี้ที่ไม่มีความเชื่อคนอื่นได้เริ่มต้นขึ้น"
  }, 
  {
    name: 'Kyokou Suiri Season 2',
    image: 'https://cdn.myanimelist.net/images/anime/1901/131653.webp', 
    title:'Kyokou Suiri Season 2', 
    description:"เรื่องราวของ Sakuragawa Kuro ชายหนุ่มผู้ชอกช้ำจากการถูกแฟนสาวบอกเลิก ซึ่งโชคชะตาก็ได้พาเขามาพบกับ Iwanaga Kotoko สาวน้อยผู้สารภาพรักกับเขา พร้อมทั้งยังบอกเขาด้วยว่าเธอนั้นคือ เทพแห่งเชาว์ปัญญาของเหล่า “ภูตพราย” แต่แล้ว Kotoko ก็ได้พบความจริงบางอย่างเกี่ยวกับตัว Kuro และได้ขอให้เขามาเป็นผู้ช่วยในการคลี่คลายเหตุการณ์ประหลาดเหนือธรรมชาติมากมาย และหวังว่าการได้ออกทำงานด้วยกันจะทำให้เขาเริ่มหันมาชอบเธอบ้าง! เรื่องราวจะเป็นอย่างไรต่อล่ะเนี่ย!?"
  }, 
  {
    name: 'Benriya Saitou-san, Isekai ni Iku',
    image: 'https://cdn.myanimelist.net/images/anime/1805/132335.webp', 
    title:'Benriya Saitou-san, Isekai ni Iku', 
    description:"ไซโต้ ช่างซ่อมบำรุงชาวญี่ปุ่นถูกส่งไปต่างโลก ในโลกแฟนตาซีที่เวทมนตร์และมอนสเตอร์มีจริง ถึงตัวเขาไม่ได้มีความสามารถในการต่อสู้ แต่ทักษะงานช่างหลายอย่างของเขาได้ช่วยเหลือปาร์ตี้ได้เป็นอย่างดี"
  }, 
  {
    name: 'Hyouken no Majutsushi ga Sekai wo Suberu',
    image: 'https://cdn.myanimelist.net/images/anime/1049/131580.webp', 
    title:'Hyouken no Majutsushi ga Sekai wo Suberu', 
    description:"“โรงเรียนเวทมนตร์อาโนลด์” เป็นแหล่งรวมตัวของจอมเวทระดับหัวกะทิจากทั่วโลก “เรย์ ไวท์” ตัวเอกของเรื่อง เป็นจอมเวทจากตระกูลสามัญชนคนแรกที่ได้เข้าเรียนนับแต่ก่อตั้งโรงเรียนแห่งนี้มา จอมเวทจากตระกูลขุนนาง ที่อยู่รอบข้างก็ดูถูกเหยียดหยามเขา แต่…ไม่มีใครเลยที่รู้ว่าเขานั้นคือ “จอมเวทดาบเหมันต์” ผู้ได้รับการกล่าวขานว่าแข็งแกร่งที่สุดในเจ็ดจอมเวทผู้ยิ่งใหญ่ของโลก"
  }, 
  {
    name: 'Spy Kyoushitsu',
    image: 'https://cdn.myanimelist.net/images/anime/1491/132864.webp', 
    title:'Spy Kyoushitsu', 
    description:"This is a description of service here and now let see if it works"
  }, 
  {
    name: 'Oniichan wa Oshimai!',
    image: 'https://cdn.myanimelist.net/images/anime/1058/131632.webp', 
    title:'Oniichan wa Oshimai!', 
    description:"Oyama Mahiro ชายที่ชื่นชอบการเล่นเกมเอโรเกะ จนกระทั่งวันหนึ่งเขาตื่นมาพบว่าตัวเองเป็นผู้หญิงด้วยฝีมือของน้องสาวผู้เป็นนักวิทยาศาสตร์ที่บ้าคลั่งอย่าง Mihari แม้ว่า Mahiro จะต้องการใช้ชีวิตแบบเดิม แต่สิ่งที่เกิดขึ้นก็ทำให้เขาต้องปรับตัวกันอีกนาน"
  }, 
  {
    name: 'Eiyuuou, Bu wo Kiwameru Tame Tenseisu: Soshite, Sekai Saikyou no Minarai Kishi♀',
    image: 'https://cdn.myanimelist.net/images/anime/1044/129594.webp', 
    title:'Eiyuuou, Bu wo Kiwameru Tame Tenseisu: Soshite, Sekai Saikyou no Minarai Kishi♀', 
    description:"อิงกลิส ราชาวีรชนผู้ยิ่งใหญ์ซึ่งได้รับอารักษ์จากเทพธิดาจนกลายมาเป็น “อัศวินเทพ” เขาอุทิศทั้งชีวิตเพื่อประเทศและประชาชน และหลังจากเขาตาย เขาก็ได้ภาวนาอย่างแรงกล้าว่าในชีวิตต่อไป “อยากจะใช้ชีวิตอย่างอิสระและขัดเกลาฝีมือการต่อสู้ของตัวเอง” คำปรารถนานั้นเป็นจริงโดยเทพธิดาทำให้อิงกลิสได้กลับชาติไปเกิดใหม่ในอนาคตอันใกล้โพ้น เขาได้เกิดมาเป็น “ลูกสาว” ของตระกูลอัศวิน!? มิหนำซ้ำในตอนที่อายุ 6 ขวบยังถูกหาว่าไม่มีพรสวรรค์ในการเป็นอัศวินอีกต่างหาก! ด้วยเหตุนี้เอง ตำนานของอัศวินฝึกหัดที่แข็งแกร่งที่สุดจึงได้เริ่มเปิดม่านขึ้น!!!"
  }, 
  {
    name: 'Kaiko sareta Ankoku Heishi (30-dai) no Slow na Second Life',
    image: 'https://cdn.myanimelist.net/images/anime/1224/132328.webp', 
    title:'Kaiko sareta Ankoku Heishi (30-dai) no Slow na Second Life', 
    description:"Dariel ชายหนุ่มวัย 30 ผู้เป็นทหารแห่งความมืด และมีตำแหน่งเป็นถึงที่ปรึกษาให้กับสี่เทพแห่งกองทัพจอมมาร แต่เพราะความที่เขาไม่สามารถใช้เวทมนตร์ได้ก็เลยถูกไล่ออกจากกองทัพ และด้วยเหตุนี้เขาจึงผันตัวไปใช้ชีวิตสโลไลฟ์กับมนุษย์ในชนบทแทน"
  }, 
  {
    name: 'Inu ni Nattara Suki na Hito ni Hirowareta.',
    image: 'https://cdn.myanimelist.net/images/anime/1832/132333.webp', 
    title:'Inu ni Nattara Suki na Hito ni Hirowareta.', 
    description:"เรื่องราวของพระเอกหนุ่มที่จู่ ๆ ก็กลายเป็นสุนัข และถูกเก็บไปเลี้ยงโดย 'คาเรน อินุไค' เพื่อนร่วมห้องที่เวลาอยู่ในโรงเรียนจะเป็นสาวสวยสุดคูล แต่เมื่ออยู่ที่บ้านกับเขา (ในร่างน้องหมา) กลับแสดงออกในอีกด้านที่คาดไม่ถึง"
  }, 
  {
    name: 'Kami-tachi ni Hirowareta Otoko 2nd Season',
    image: 'https://cdn.myanimelist.net/images/anime/1521/131469.webp', 
    title:'Kami-tachi ni Hirowareta Otoko 2nd Season', 
    description:"ทาเคบายาชิ เรียวมะ หนุ่มญี่ปุ่น วัย 39 ปี ที่ทำงานหนักมาตลอด จนเขาได้เสียชีวิตลง ได้พบเหล่าเทพ 3 องค์ที่ให้โอกาสเขาได้เกิดใหม่ที่โลกแฟนตาซีในร่างเด็ก ตั้งใจที่จะใช้ชีวิตใหม่ที่แตกต่างจากชาติก่อนของตน ฝึกฝนการต่อสู้และเวทมนตร์ เขาให้ความสนใจที่จะวิจัยพวกสไลม์ สิ่งมีชีวิตทีมีหลายอย่างให้ค้นหา ตั้งใจเลี้ยง และค้นหาสไลม์พันธุ์อื่นๆ ในโลกใหม่นี้"
  }, 
  {
    name: 'High Card',
    image: 'https://cdn.myanimelist.net/images/anime/1803/131345.webp', 
    title:'High Card', 
    description:"เรื่องราวของอาณาจักรโฟร์แลนด์ในคาบมหาสมุทรแอตแลนติกเหนือที่มี “X-Playing Card” ไพ่ 52 ใบที่ว่ากันว่าเป็นต้นกำเนิดของไพ่ทรัมป์ และแต่ละใบจะมีความสามารสถิตถอยู่ นอกจากนี้มันยังสามารถมอบพลังให้กับ “Player” ที่มีคุณสมบัติด้วย จนอยู่มาวันหนึ่งมันได้กระจัดกระจายออกไปคนละทิศคนละทาง ทำให้บ้านเมืองเกิดความปั่นป่วน และนั่นทำให้ต้องมีกรุ๊ป “High Card” ขึ้นมาเพื่อนำไพ่เหล่านั้นกลับมาด้วยการเล่นไพ่!"
  }, 
  {
    name: 'Sugar Apple Fairy Tale',
    image: 'https://cdn.myanimelist.net/images/anime/1897/131300.webp', 
    title:'Sugar Apple Fairy Tale', 
    description:"เป็นเรื่องราวของ แอน หญิงสาวคนหนึ่งที่มีความใฝ่ฝันอยากจะเป็น 'ช่างทำน้ำตาลสีเงิน' เหมือนกับคุณแม่ของเธอที่เสียไป ในอาณาจักรไฮแลนด์ซึ่งเป็นสถานที่ที่มนุษย์ใช้งานและข่มเหงรังแกเหล่าภูติ แต่สำหรับแอนนั้นไม่ใช่ เธอมองภูติเท่าเทียมกับมนุษย์ แอนได้ซื้อ แชล ภูตินักรบหนุ่มสุดหล่อแต่ปากร้ายมาร่วมเดินทางคอยคุ้มกันเธอไปยังเมืองหลวง เพื่อส่งประกวดผลงานน้ำตาลสีเงินที่เธอสร้างสรรค์ขึ้นมา หลังจากถึงจุดหมายเธอก็จะคืนอิสรภาพให้แก่แชล ระหว่างการเดินทางแอนก็อยากจะเป็นเพื่อนที่ดีกับภูติอย่างแชลด้วย เพราะนั่นคืออีกสิ่งที่เธอหวัง เธออยากให้มนุษย์และภูติอยู่ร่วมกันได้อย่างเสมอภาค เรื่องราวการเดินทางและเส้นทางสู่ความฝันของแอนจะเป็นอย่างไรต่อไปต้องลองไปดูกัน"
  }, 
  {
    name: 'Shin Shinka no Mi: Shiranai Uchi ni Kachigumi Jinsei',
    image: 'https://cdn.myanimelist.net/images/anime/1862/128297.webp', 
    title:'Shin Shinka no Mi: Shiranai Uchi ni Kachigumi Jinsei', 
    description:"เรื่องราวของหนุ่มอ้วนคนหนึ่งที่ชื่อ ฮิรากิ เซอิจิ เขานั้นมักจะถูกเพื่อนร่วมชั้นกลั่นแกล้งและรังแกอยู่เสมอแม้แต่กระทั่งตอนที่ทุกคนในห้องเรียนถูกส่งตัวไปยังต่างโลกที่เหมือนกับเกมเซอิจิก็ยังถูกปล่อยให้อยู่คนเดียว แม้ในช่วงแรกที่มาต่างโลกจะทุลักทุเลไปบ้างแต่เมื่อเขาได้รู้จักกับผลไม้แห่งการวิวัฒนาการและได้พบกับกอริล่าตัวหนึ่งชีวิตของเขาก็เปลี่ยนไป"
  }, 
  {
    name: 'Tsundere Akuyaku Reijou Liselotte to Jikkyou no Endou-kun to Kaisetsu no Kobayashi-san',
    image: 'https://cdn.myanimelist.net/images/anime/1997/131327.jpg', 
    title:'Tsundere Akuyaku Reijou Liselotte to Jikkyou no Endou-kun to Kaisetsu no Kobayashi-san', 
    description:"โคบายาชิ สาวที่ประทับใจตัวร้ายสายซึน ลิเซลอตต์ ในเกมจีบหนุ่ม แต่น่าเศร้าที่ชะตากรรมเธอในเกมนั้นจบไม่สวย โคบายาชิได้ชวนเพื่อนหนุ่ม เอนโด เล่น แล้วพบว่าทั้งสองติดต่อกับตัวละครในเกมได้เหมือนเป็นเสียงจากพระเจ้าที่ชี้นำตัวละคร ทำให้เจ้าชายคู่หมั้นได้เห็นด้านน่ารักของ ลิเซลอตต์ และเปลี่ยนแปลงโลกในเกมผ่านคำพูดของผู้เล่นทั้งสอง"
  }, 
  {
    name: 'Rougo ni Sonaete Isekai de 8-manmai no Kinka wo Tamemasu',
    image: 'https://cdn.myanimelist.net/images/anime/1890/131473.webp', 
    title:'Rougo ni Sonaete Isekai de 8-manmai no Kinka wo Tamemasu', 
    description:"ยามาโนะ มิตสึฮะ สาวมัธยมปลายวัย 18 ปี ที่ต้องอยู่ตามลำพัง หลังพ่อแม่พี่ชายประสบอุบัติเหตุเสียชีวิตกะทันหัน วันหนึ่งเธอถูกผลักตกจากเนินแล้วตื่นขึ้นมาในโลกแฟนตาซี เมื่อเกือบตายจากฝูงหมาป่า ทำให้เธอพบว่าเธอมีพลังที่ทำให้ข้ามระหว่างญี่ปุ่นและโลกแฟนตาซีได้ เธอตั้งใจใช้ประโยชน์จากพลังนี้ ตั้งเป้าหมายหาเงินให้ได้ 2 พันล้านเยนด้วยสติปัญญาและความเจ้าเล่ห์ของเธอ"
  }, 
  {
    name: 'Revenger',
    image: 'https://cdn.myanimelist.net/images/anime/1884/131748.webp', 
    title:'Revenger', 
    description:"อุซุย ได้พบ ไรโซ ชายที่รอดจากการสังหารหมู่ จึงร่วมมือกันตามหาเบาะแสการฆาตกรรมตระกูลซามูไรที่มีเงื่อนงำ"
  }, 
  {
    name: 'Ayakashi Triangle',
    image: 'https://cdn.myanimelist.net/images/anime/1078/131921.webp', 
    title:'Ayakashi Triangle', 
    description:"คาซามากิ มัตสึริ พระเอกของเรื่องนี้เป็นนินจาปราบภูตผีเพื่อปกป้องคานาเดะ สุซุเพื่อนสมัยเด็กของเขา ที่ชอบดึงดูดเหล่าภูตผีอันตรายที่ถูกเรียกว่า อายาคาชิ เข้ามาหาตัวอยู่เสมอ มัตสึริจึงคอยปกป้องสุซุจากเหล่าภูตผีมาตลอดและจู่ ๆ ก็ได้เกิดเหตุการณ์บางอย่างซึ่งทำให้ชีวิตของมัตสึริต้องเปลี่ยนไป!"
  }, 
  {
    name: 'Mononogatari',
    image: 'https://cdn.myanimelist.net/images/anime/1173/131830.webp', 
    title:'Mononogatari', 
    description:"เฮียวม่า เด็กหนุ่มผู้ถูกโดนทสึคุโมะกามิพรากสิ่งสำคัญไปตลอดชีวิต และ โบตั๋น เด็กสาวที่ใช้ชีวิตร่วมกับทสึคุโมะกามิ ในฐานะผู้นำครอบครัว ทั้งสองและทสึคุโมะกามิต้องมาอยู่ร่วมกันใต้ชายคาบ้านเดียวกัน นี้คือเรื่องราวระหว่างคนกับทสึคุโมะกามิ ความผูกพันและความรักได้เปิดม่านขึ้นแล้ว"
  }, 
  {
    name: 'Tsurune: Tsunagari no Issha',
    image: 'https://cdn.myanimelist.net/images/anime/1803/132337.webp', 
    title:'Tsurune: Tsunagari no Issha', 
    description:"เรื่องราวของ Narumiya Minato เด็กผู้เล่นกีฬายิงธนู แต่ด้วยเหตุการณ์บางอย่างทำให้เขาเลิกเล่นมันไป จนกระทั่งการได้เข้าไปในโรงเรียนมัธยมได้พบเพื่อนใหม่ นั่นทำให้เขาเข้าชมรมยิงธนูและมุ่งสู่การแข่งขันระดับจังหวัด"
  }, 
  {
    name: 'Ooyukiumi no Kaina',
    image: 'https://cdn.myanimelist.net/images/anime/1064/131833.webp', 
    title:'Ooyukiumi no Kaina', 
    description:"โลกถูกปกคลุมด้วยหิมะ เรื่องราวของ ไคนะ หนุ่มจากองค์กร Celestial Membrane ที่อาศัยใน Orbital Tree และ ลิลิฮะ สาวจากผืนดิน ได้มาพบกันแล้วผจญภัยร่วมกัน"
  }, 
  {
    name: 'Ars no Kyojuu',
    image: 'https://cdn.myanimelist.net/images/anime/1866/133949.webp', 
    title:'Ars no Kyojuu', 
    description:"เรื่องราวในยุคดาบ, วีรบุรุษ และ อสูรยักษ์ผู้สร้างดินแดนนี้ขึ้นมาแต่มนุษย์ได้ขโมยพวกมันไปทำให้อสูรเหล่านี้โกรธและเริ่มกินพวกมนุนษย์ เพื่อการตอบโต้มนุษย์จึงต้องหาเหล่าพระเจ้า อสูร Kyojuu เริ่มแพร่กระจายไปทั่วโลกและสร้างความเสียหายทั่วโลก แต่มนุษย์เลือกที่จะสู้และล่าพวก Kyojuu กลับ"
  }, 
  {
    name: 'Hikari no Ou',
    image: 'https://cdn.myanimelist.net/images/anime/1787/131675.webp', 
    title:'Hikari no Ou', 
    description:"หลังจากสงครามครั้งสุดท้ายของมนุษยชาติสิ้นสุดลง ผลของสงครามทำให้พื้นโลกถูกปกคลุมไปด้วยป่าสีดำ พร้อมกับเชื้อโรคลึกลับที่ส่งผลให้ร่างกายลุกไหม้เมื่อเข้าใกล้เปลวไฟตามธรรมชาติ! ในโลกใบใหม่นี้เองมนุษย์จำต้องค้นหาไฟเพื่อใช้ด้วยการตามล่า “อสูรเพลิง” สัตว์อสูรลึกลับตัวสีดำที่อาศัยอยู่ในป่าลึก แต่ทว่าการล่าอสูรเพลิงนั้นไม่ใช่เรื่องง่าย เพราะอสูรเพลิงพวกนี้ต่างมีร่างกายที่แข็งแกร่ง มนุษย์จึงจำเป็นต้องฝึกฝนตนเองอย่างหนัก จนได้ตั้งเป็นกลุ่มขึ้นมาเพื่อออกล่าโดยเฉพาะ และมนุษย์ที่ออกล่าอสูรย์เหล่านี้จะถูกเรียกว่า “นักล่าไฟ”เหล่านักล่าไฟต่างออกตามล่าอสูรเพลิงมาเป็นเวลานานและกลายเป็นการต่อสู้ที่แสนดุเดือด ในหมู่นักล่าเองก็มีทั้งที่ประสบความสำเร็จมีชื่อเสียงเงินทอง และผู้ที่ตายหรือไม่ก็พิการอยู่มากมาย แต่ว่ากับมีข่าวลืออยู่หนึ่งอย่างที่เหมือนกันว่า “นักล่าไฟที่สามารถล่าดาวหางพันปี ‘เพลิงระยับ’ ซึ่งรอนแรมผ่านผืนฟ้าอันว่างเปล่าลงได้ จะได้รับการขนานนามว่า ราชาแห่งนักล่าไฟ” ทั้งหมดTouko หญิงสาวผู้เติบโตขึ้นมาในหมู่บ้านแห่งหนึ่ง และ Koushi อดีตนักศึกษาจากเมืองหลวง ทั้งคู่นั้นมีชีวิตที่แตกต่างกันอย่างมากที่ไม่ว่ามองทางไหนก็ไม่สามารถเข้ากันได้เลย แต่ทว่าโชคชะตาก็ได้นำพาพวกเขามาพบกัน จึงเกิดเป็นการเดินทางสุดยิ่งใหญ่ของชายหญิงทั้งสอง ซึ่งโชคชะตานี้ของพวกเขาจะทำให้โลกทั้งใบต้องเปลี่ยนไป.."
  }, 
  {
    name: 'Nokemono-tachi no Yoru',
    image: 'https://cdn.myanimelist.net/images/anime/1087/129002.webp', 
    title:'Nokemono-tachi no Yoru', 
    description:"ช่วงปลายศตวรรษที่ 19 วิสเทเรีย สาวกำพร้าในอังกฤษที่กำลังจะโดนขาย เธอมองเห็นอสูรอมตะ มัลบัส ผู้ที่คนทั่วไปมองไม่เห็น หลังจากได้รู้จักกัน เขาตัดสินใจช่วยโดยแลกกับการมองเห็นของเธอ ทั้งสองออกเดินทางหาที่สงบสุขและปลอดภัยด้วยกัน แต่ยังคงโดนตามล่าจากเหล่านักล่าที่ต้องการฆ่ามัลบัส"
  }, 
  {
    name: 'The Legend of Heroes: Sen no Kiseki - Northern War',
    image: 'https://cdn.myanimelist.net/images/anime/1894/133297.webp', 
    title:'The Legend of Heroes: Sen no Kiseki - Northern War', 
    description:"เลเวียน สาวที่เกิดในประเทศที่ยากจนตะวันตกเฉียงเหนือของทวีปเซมุเรียน ได้ร่วมกลุ่มทหารรับจ้างสู้ปกป้องบ้านเกิด จัดตั้งหน่วยสปายเข้าไปในพื้นที่ของข้าศึก เพื่อหาความจริงเกี่ยวกับวีรบุรุษแห่งจักรวรรดิ์ ที่ถูกใช้ข่มขวัญในการรุกรานบ้านเกิดเธอ"
  },
  {
    name: 'Kyuuketsuki Sugu Shinu 2',
    image: 'https://cdn.myanimelist.net/images/anime/1254/131832.webp', 
    title:'Kyuuketsuki Sugu Shinu 2', 
    description:"ในญี่ปุ่น มีปราสาทที่มีแวมไพร์อมตะพักอาศัยอยู่ นักล่าแวมไพร์ โรนัลด์ ถูกจ้างไปช่วยเด็กที่หายสาปสูญ จนพบว่าเป็นเพียงเรื่องเข้าใจผิด ที่ซึ่งทำให้เขาได้รู้จักกับแวมไพร์ ดราลุค ที่ไม่ได้น่ากลัวอย่างที่เล่าขาน ตรงกันข้าม กลับมีนิสัยกวนประสาท ตาย-ฟื้นจากทุกเรื่องแล้ว แล้วชอบเข้าไปยุ่งเรื่องคนอื่นเป็นประจำ หลังเกิดเหตุที่ปราสาท เขาได้มาอยู่กับ โรนัลด์ และได้รู้จักทั้งมนุษย์ นักล่าแวมไพร์ แดมพีร์ และพวกแวมไพร์ที่นิสัยแตกต่างกัน"
  }, 
  {
    name: 'Mou Ippon!',
    image: 'https://cdn.myanimelist.net/images/anime/1039/131684.webp', 
    title:'Mou Ippon!', 
    description:"โซโนดะ มิจิ สาวที่แพ้ในการแข่งยูโดมัธยมต้นปี 3 จนอยากเลิก แต่เพื่อนสนิทพยายามให้เธอเล่นต่อ และพยายามอีกครั้งตอนมัธยมปลาย"
  }, 
  {
    name: 'Majutsushi Orphen Hagure Tabi: Urbanrama-hen',
    image: 'https://cdn.myanimelist.net/images/anime/1388/132318.webp', 
    title:'Majutsushi Orphen Hagure Tabi: Urbanrama-hen', 
    description:"ออร์เฟน ชายหนุ่มที่ออกเดินทางตามหาพี่สาว ที่ร่างกายกลายเป็นสัตว์ประหลาดจากการทดลอง และหาวิธีที่จะทำให้เธอได้กลับมามีร่างกายเป็นมนุษย์อีกครั้ง โดยในภาค 2 จะเป็นเรื่องราวในเมืองคิมลัก ที่ขึ้นชื่อว่าเป็นเมืองที่เกลียดชังจอมเวทย์ และที่นี่ก็จะมีบททดสอบใหม่รอคอยพวก ออร์เฟน อยู่!"
  }, 
  {
    name: 'Technoroid: Overmind',
    image: 'https://cdn.myanimelist.net/images/anime/1208/132388.webp', 
    title:'Technoroid: Overmind', 
    description:"เรื่องราวในโลกยุคอนาคตที่วิทยาการแอนดรอยด์พัฒนาไปถึงขีดสุด จนทำให้พวกเขามีความนึกคิดและจิตใจเหมือนดั่งมนุษย์ ซึ่งสวนทางกับสภาพของโลกเป็นอย่างมาก ที่ซึ่งปัจจุบันพื้นที่หลายแห่งของโลกที่มนุษย์อาศัยแทบทุกที่ต้องเผชิญเข้ากับภับพิบัติทางธรรมชาติอยู่มากมาย ไม่ว่าจะเป็นปัญหาน้ำท่วม แสงแดดที่ร้อนระอุที่แผดเผาจนไม่สามารถที่จะอาศัยอยู่ได้ จึงทำให้พื้นที่อยู่อาศัยหลายแห่งทั่วโลกมีอย่างจำกัด.จนกระทั่งการปรากฎของพื้นที่อยู่อาศัยที่ถูกเรียกว่า “Babel” หอคอยอันสวยงามที่ตั้งตระง่านอย่างโดดเด่น สถานที่ซึ่งกลายเป็นความหวังใหม่ในการมีชีวิต และไม่ใช่มีเพียงแค่มนุษย์เท่านั้น แต่ยังรวมถึงเหล่าแอนดรอยด์ด้วยเช่นกันที่ต่างก็ปรารถนาในการอาศัยอยู่ ณ ดินแดนแห่งใหม่ที่ซึ่งเต็มไปด้วยความหวังและความฝัน เสียงดนตรี การขับร้องเพลงที่ขาดหายไปนานได้กลับมาดังขึ้นอีกครั้ง จนกลายเป็นดั่งแหล่งบันเทิงแห่งใหม่ที่สามารถให้มนุษย์และแอนดรอยด์ได้ใช้ที่แห่งนี้ประชันเสียงดนตรีกัน เพื่อมุ่งสู่จุดสูงสุดของหอคอยแห่งนี้ และนี่เองคือเรื่องราวของกลุ่มคนและแอนดรอยด์ที่ต่างต้องแข่งขันกันด้วยเสียงร้องและดนตรีอันแสนไพเราะ ท่ามกลางนครแห่งใหม่ที่เต็มไปด้วยความหวังของพวกเขาทั้งสองเผ่าพันธ์จึงได้เริ่มขึ้น…"
  }, 
  {
    name: 'D4DJ All Mix',
    image: 'https://cdn.myanimelist.net/images/anime/1995/129754.webp', 
    title:'D4DJ All Mix', 
    description:"หลังจากกลับมาที่ญี่ปุ่นหลังจากใช้ชีวิตอยู่กับพ่อแม่ตั้งแต่เด็ก Rinku Aimoto นักเรียนม. ปลายคนใหม่ได้เข้าเรียนในสถาบัน Yoba girls หลังจากที่เธอได้เห็นดีเจยูนิตชื่อดัง “Peaky P Key” ของโยบะ ริงกุสนใจในงานดีเจและได้พบกับมาโฮะอาคาชิซึ่งเป็นดีเจในตำแหน่งโฆษกของโรงเรียน พวกเขาร่วมกันก่อตั้งยูนิตดีเจชื่อ “Happy Around” เพื่อแสดงเพลงของพวกเขา"
  }, 
  {
    name: 'Nijiyon Animation',
    image: 'https://cdn.myanimelist.net/images/anime/1977/135538.webp', 
    title:'Nijiyon Animation', 
    description:"อนิเมสั้นเรื่องราวในชีวิตประจำวันของสมาชิกชมรมสคูลไอดอลทั้ง 13 คน แห่งโรงเรียนนิจิกะซากิ ซึ่งอยู่บนเกาะโอไดบะในโตเกียว"
  }, 
  {
    name: 'UniteUp!',
    image: 'https://cdn.myanimelist.net/images/anime/1308/130458.webp', 
    title:'UniteUp!', 
    description:"Kiyose Akira นักเรียนมัธยมปลายผู้หลงไหลในการร้องเพลง และเพลงของเขาได้ถูกอัพลงโลกอินเตอร์เน็ต อยู่มาวันหนึ่ง sMiLea Production บริษัทผู้ค้นหาไอดอลที่มีความสามารถได้ติดต่อเขาเพราะสนใจในเสียงร้องของ Akira เพื่อมาเขากลุ่มไอดอลในสังกัด และความฝันครั้งใหม่ก็เริ่มขึ้น"
  }, 
  {
    name: 'Hirogaru Sky! Precure',
    image: 'https://cdn.myanimelist.net/images/anime/1762/135268.webp', 
    title:'Hirogaru Sky! Precure', 
    description:"เรื่องราวเกิดขึ้นในสองสถานที่กับสองสาวพรีเคียว: ดินแดนแห่งสรวงสวรรค์ Skyland และ Sorashido เมืองที่รายล้อมไปด้วยธรรมชาติ อยู่มาวันหนึ่งเจ้าหญิง El แห่ง Skyland ถูกสัตว์ประหลาดจากจักรวรรดิ Underg ตามล่า Harewataaru Sota เด็กสาวผู้กล้าหาญผู้ใฝ่ฝันจะเป็นฮีโร่ ได้ติดตามเจ้าหญิงเข้าไปในหลุมลึกลับไปสู่อีกโลกหนึ่งในเมือง Sorashido ที่นั่นเธอได้พบกับเด็กสาวม.ปลายปีสองชื่อ Nijigaoka Mashiro และภารกิจการปกป้องโลกของทั้งคู่ก็เริ่มต้นขึ้น"
  }, 
  {
    name: 'Boku to Roboko',
    image: 'https://cdn.myanimelist.net/images/anime/1986/134747.webp', 
    title:'Boku to Roboko', 
    description:"เรื่องราวในอนาคตที่ทุกบ้านจะมีหุ่นยนต์เมดที่เรียกว่าออเดอร์เมด นักเรียนประถมธรรมดาคนหนึ่งชื่อไทระ บอนโดะฝันที่จะมีมีหุ่นยนต์เมดเป็นของตนเอง เพราะเพื่อนของเขาคือกาจิ กอริลล่าและคาเนโอะ โมซึโอะมักจะอวดเรื่องออร์เดอร์เมดของบ้านคาเนโอะชื่อเมโกะ บอนโดะขอร้องแม่จนแม่ตกลงซื้อให้ แต่สิ่งที่ได้รับคือเมดที่เหนือความคาดหมายชื่อโรโบโกะ หุ่นยนต์เมดซุ่มซ่ามแต่ทรงพลังที่สุดเท่าที่เคยมีมา ด้วยการมาของโรโบโกะ ชีวิตของบอนโดะก็ยิ่งแปลกประหลาดยิ่ง ๆ ขึ้นไป"
  }, 
  {
    name: 'Flaglia: Natsuyasumi no Monogatari',
    image: 'https://cdn.myanimelist.net/images/anime/1065/129807.webp', 
    title:'Flaglia: Natsuyasumi no Monogatari', 
    description:"ไอโกะ นักเรียนชั้นประถมศึกษาปีที่ 3 อาศัยอยู่กับพี่ชาย 4 คนในบ้านเก่าในทาเตยามะ ครอบครัวของอิโกะไม่มีพ่อแม่ และพี่ชายของเขาเล่าว่า แม่ของพวกเขาทำงานในโตเกียว แม้จะดูแปลกไปสักหน่อย แต่ ไอโกะ ก็รักพี่น้องของเขาที่ดูแลเขาเป็นอย่างดี แต่พวกเขามีความลับ พวกเขาคือพ่อมดที่มีชีวิตอยู่เกือบตลอดไป... เรื่องราวเกี่ยวกับวันหยุดฤดูร้อนของครอบครัวในเมืองชายทะเลที่ใช้ชีวิตร่วมกันอย่างมีความสุข ขณะที่ติดอยู่ในโลกของพ่อมด"
  }, 
  {
    name: 'Cardfight!! Vanguard: will+Dress Season 2',
    image: 'https://cdn.myanimelist.net/images/anime/1259/131669.webp', 
    title:'Cardfight!! Vanguard: will+Dress Season 2', 
    description:"Cardfight!! Vanguard will+Dress เป็นอนิเมะซีรีส์ใหม่ต่อจาก Cardfight!! Vanguard overDress ที่ฉายเมื่อปี 2021 โดยจะได้ผู้ออกแบบไกด์ตัวละครเป็น CLAMP เช่นเดิม ซึ่งเนื้อเรื่องของ will+Dress จะเกี่ยวข้องกับเหล่านักสู้ทั้ง 16 คนจากทั่วโลกเพื่อมาประลองการ์ดกันใน “Deluxe Tournament”"
  }, 
  {
    name: 'KJ File 2nd Season',
    image: 'https://cdn.myanimelist.net/images/anime/1416/132315.webp', 
    title:'KJ File 2nd Season', 
    description:"สำหรับเรื่อง KJ File 2nd Season ทางสตูดิโอไม่ได้มีการเปิดเผยเนื่อเรื่องย่อแต่อย่างใด แต่ได้มีการบอกคอนเซ็ปคล่าวไว้ว่า อนิเมะ KJ File มีสัตว์ประหลาดออริจินัลที่จะถูกสร้างในงานสไตล์ยุคโชวะ และสัตว์ประหลาดแต่ละตัวจะมีเพลงประกอบของตัวเอง ด้านเนื้อเรื่องนั้นจะเกี่ยวข้องกับโลกที่จู่ๆ ก็มีสัตว์ประหลาดปรากฎตัวขึ้นมาทั่วโลก"
  },    
  {
    name: 'Yomawari Neko',
    image: 'https://cdn.myanimelist.net/images/anime/1085/131383.webp', 
    title:'Yomawari Neko', 
    description:"เรื่องราวของ Endo Heizo คุณแมวที่ปรากฎตัวในยามค่ำคืน ผู้เดินตามกลิ่นน้ำตาในยามค่ำคืน เพื่อที่จะไปให้กำลังใจเหล่าคนที่เจ็บปวดและร้องไห้กับชีวิตอันน่าเศร้า ซึ่งในแต่ละคืนเราจะได้เห็นคุณ Endo ตระเวณไปให้กำลังใจผู้คนต่างที่ต่างรูปแบบ แน่นอนว่านอกจากคุณ Endo แล้วยังมีคุณแมวอีกหลายตัว รวมถึงตัวละครมนุษย์ที่อาจจะเป็นเหมือนคุณอยู่ก็ได้!"

  } ];

  $scope.selected = [];
  $scope.selectBox = function(item, position) {
    $scope.selected = [{
      item: item,
      position: position
    }];
    $scope.$apply();
  }
  $scope.clearSelection = function() {
    $scope.selected = [];
  }
})

app.directive('box', function() {
  return {
    restrict: 'E',
    scope: {},
    bindToController: {
      onSelect: "=",
      item: "="
    },
    controllerAs: 'box',
    controller: function() {
      var box = this;

      box.goFullscreen = function(e) {
        box.onSelect(box.item, e.target.getBoundingClientRect())
      }
    },
    link: function(scope, element) {
      //this to change text in the box onclick (must add this)
      element.bind('click', scope.box.goFullscreen)
      element.css({
        'background-image': 'url(' + scope.box.item.image + ')'
      })
      element.html('<div class="box-overlay"><h2>' + scope.box.item.title + '</h2><button>Learn More</button></div>')
    }
  }
})

app.directive('bigBox', function($timeout) {
  return {
    restrict: 'AE',
    scope: {},
    bindToController: {
      position: "=",
      selected: "=",
      onSelect: "="
    },
    controllerAs: 'box',
    controller: function() {
      var box = this;
    },
    link: function(scope, element) {
      var css = {}
      for (var key in scope.box.position) {
        css[key] = scope.box.position[key] + 'px';
      }
      
      element.css(css);

      $timeout(function() {
        element.css({
          top: '50%',
          left: '10%'
        })
        //element.addClass('image-out');
      }, 200)
      $timeout(function() {
        element.addClass('image-out');
      }, 600)

      $timeout(function() {
        element.css({
          width: '80%',
          height: '60%'
        })
      }, 500)
      
      $timeout(function(){
        element.addClass('show');
      }, 1000)
    }
  }
})</script>